# На уроке

## 0) Знокомство + Расскажу общую информацию про python. 

## 1) IDE

### Теория:
Расскажу про основные IDE и расскажу зачем она нужна

### Закрепление:
Скачаем pycharm. Откроем тестовый проект. Фишки IDE и функционал лучше отрабатывать в процессе всей работы над проектом для лучшего запоминания.
Закрепление будет на протяжении всего курса. Так как будем работать в этой IDE

## 2) Базовый синтаксис

### Теория:
Пункт 1.7 синтаксис python. Пробелы, PEP8 и тд


### Закрепление:

## 3) Переменные, операторы, типы переменных

### Теория:

Теория из пункта 1

Переменная это ссылка на обьект в памяти python. Вопрос к аудитории (во время выполнения это ссылка на обьект в какой памяти? Оперативной)

### Закрепление:
1) Создадим переменную в IDE и выведем в консоль
```python
my_name = 'Ilya'
print(f'Hello world, my name {my_name}')
```
2) Пример переопределения переменных
```python
name = 'Ilya'
print(f'Hello world, my name {my_name}')
name = 'Oleg'
print(f'Hello world, my name {my_name}')
```

3) Посложнее
```python
number = 5 # int

digit = -4.54356876 # float
word = "Результат:" # string
boolean = True # bool

str_num = '5' # string

# print(word + str(digit))

print(word + str(number + int(str_num)))

del number

number = 7
print("Результат:", number)
```
## (Здесь нужно рассказать 6 пункт)
## 4) Условные конструкции, циклы

### Теория:
#### Условные конструкции
https://github.com/titaev/brunoyam-python-lessons/blob/master/1.%20Introduction%20to%20Python.md  (8 пункт)
#### Циклы
https://github.com/titaev/brunoyam-python-lessons/blob/master/3.%20Cycles.md

### Закрепление:
#### Задача 1
Напишите программу, которая будет выводить нечетные числа из списка и остановится, если встретит число 139
```python
#  Функция, которая проверяет входной параметр на четность
def even(num):
    # Возвращаем True, если остаток от деления на 2 равен нулю
    return num % 2 == 0


if __name__ == '__main__':
    lst = [1, 34, 78, 345, 111, 8, 5, 34, 9, 3, 139, 56, 2, 67, 69, 90]

    # В цикле перебираем элементы вышесозданного списка
    for item in lst:
        # Если текущий элемент равен 139, то прерываем цикл
        if item == 139:
            break
        # Выводим элемент, если он не является четным
        if not even(item):
            print(item)
```

#### Задача 2
Дан список lst = [11, 5, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20]. 
Необходимо вывести элементы, которые одновременно 1) меньше 30 и 2) делятся на 3 без остатка. Все остальные элементы списка необходимо просуммировать и вывести конечный результат.
```python
# Задаем константы для значений, заданных в условии
MEDIAN = 30
DIV_NUM = 3

# Создаем список
lst = [11, 5, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20]

# Задаем начальное значение переменной для суммы элементов
sm = 0

# Поочередно перебираем элементы списка
for item in lst:
    # Проверяем, что
    # 1) Текущий элемент меньше 30
    # 2) Остаток от деления текущего элемента на 3 равен 0
    if (item < MEDIAN) and (item % DIV_NUM == 0):
        print(item)
    # Добавляем элемент к сумме, если условие не выполнено
    else:
        sm += item

# Выводим конечную сумму
print('Sum: ', sm)
```
## 5) Ввод - вывод, файловый ввод вывод

### Теория:
stdout stdin stderr
https://docs-python.ru/standart-library/modul-sys-python/obekty-stdin-stdout-stderr-modulja-sys/

Файловый
Пункт 6
https://github.com/titaev/brunoyam-python-lessons/blob/master/6.%20File%20input-output%2C%20serialization-deserialization.md

### Закрепление:
Пример ввода вывода
```python
qty = int(input("Сколько апельсинов? "))
price = float(input("Цена одного? "))
 
summa = qty * price
 
print("Заплатите", summa, "руб.")
```

#### Задача 1
Напишите программу (файл user.py), которая запрашивала бы у пользователя:
- его имя (например, "What is your name?")
- возраст ("How old are you?")
- место жительства ("Where are you live?")
После этого выводила бы три строки:
"This is имя"
"It is возраст"
"(S)he live in место_жительства"
Вместо имя, возраст, место_жительства должны быть данные, введенные пользователем. Примечание: можно писать фразы на русском языке, но если вы планируете стать профессиональным программистом, привыкайте к английскому.

#### Задача 2 (файловый ввод вывод)
Сохранить в файл прочитать из него что либо

## 6) Встроенные структуры данных
Этот пункт нужно рассказывать после 3

### Теория:

https://github.com/titaev/brunoyam-python-lessons/blob/master/2.%20Built-in%20types%20and%20the%20simplest%20operations%20on%20them.md

### Закрепление:
Создать словарь и различные операцуии над ним

Тоже самое с остальными структурами данных

## 7) Стандартные функции

### Теория:
https://github.com/titaev/brunoyam-python-lessons/blob/master/4.%20Functions.md

### Закрепление:


## 8) Свои функции 

### Теория:
Тот же пункт что и в 7
https://github.com/titaev/brunoyam-python-lessons/blob/master/4.%20Functions.md

### Закрепление:

Написать функцию month_to_season(), которая принимает 1 аргумент - номер месяца - и возвращает название сезона, к которому относится этот месяц. 
Например, передаем 2, на выходе получаем 'Зима'.
```python
# Имя функции: month_to_season
# Параметр: month
def month_to_season(month):

    # Создание словаря для хранения информации о сезонах
    # Ключ: кортеж(tuple) из номеров входящих в сезон месяцов
    # Значение: строка(str)-название сезона
    season_ranges = {
        (12, 1, 2): 'Winter',
        (3, 4, 5): 'Spring',
        (6, 7, 8): 'Summer',
        (9, 10, 11): 'Autumn'
    }
    # Создание переменной для возвращаемого значения функции
    season = None

    # Цикл, в котором по очереди перебираются пары ключ-значение(номера месяцев - сезон) из словаря
    for key, value in season_ranges.items():
        # Если значение входного параметра(номер месяца) входит в состав ключа(пример ключа - (3, 4, 5))
        if month in key:
            # То присваиваем возвращаемой переменной season название сезона
            season = value
            # Останавливаем цикл
            break
            
    # Возвращаем название сезона
    return season


# Проверяем работу функции
print(month_to_season(1))
print(month_to_season(5))
print(month_to_season(8))
print(month_to_season(9))
print(month_to_season(12))
print(month_to_season(999))
```
## 8) Система контроля версий. Git

### Теория:
https://gitlab.com/OlegYurchik/brunoyam-python-lessons/-/blob/master/16.%20Git.md

### Закрепление:
Создадим репо, зальем код, создадим доп ветку dev, сделаем изменения в дев, 
сделаем пр дев в мастер, 


# Самостоятельная работа:
## Задача 1 (функция, if, операторы)
Создать функцию calc(a, b, operation). Описание входных параметров:
1. Первое число
2. Второе число
3. Действие над ними:
   1) '+' Сложить
   2) '-' Вычесть
   3) '*' Умножить
   4) '/' Разделить
   5) В остальных случаях функция должна возвращать "Операция не поддерживается"
   
```python
def calc(a, b, operation):
    # Задаем дефолтное значение возвращаемого результата
    result = 'Операция не поддерживается'

    if operation == '+':
        result = a + b
    elif operation == '-':
        result = a - b
    elif operation == '*':
        result = a * b
    elif operation == '/':
        # Проверка деления на ноль
        if b is not 0:
            result = a / b
        else:
            result = 'Деление на 0!'

    # Возвращаем результат выполнения функции
    return result


if __name__ == '__main__':
    # Проверяем корректные значения
    print(calc(30, 15, '+'))
    print(calc(30, 15, '-'))
    print(calc(30, 15, '*'))
    print(calc(30, 15, '/'))
    # Проверяем проверку деления на ноль
    print(calc(30, 0, '/'))
    # Проверяем неподдерживаемую операцию
    print(calc(30, 15, '%'))
```

# Домашнее задание:


