# На уроке

## 0) Расскажу общую информацию про python. 

## 1) IDE

### Теория:
Расскажу про основные IDE и расскажу зачем она нужна

### Закрепление:
Скачаем pycharm. Откроем тестовый проект. Фишки IDE и функционал лучше отрабатывать в процессе всей работы над проектом для лучшего запоминания.
Закрепление будет на протяжении всего курса. Так как будем работать в этой IDE

## 2) Базовый синтаксис

### Теория:
Пункт 1.7 синтаксис python. Пробелы, PEP8 и тд


### Закрепление:

## 3) Переменные, операторы, типы переменных

### Теория:

Теория из пункта 1

Переменная это ссылка на обьект в памяти python. Вопрос к аудитории (во время выполнения это ссылка на обьект в какой памяти? Оперативной)

### Закрепление:
1) Создадим переменную в IDE и выведем в консоль
```python
my_name = 'Ilya'
print(f'Hello world, my name {my_name}')
```
2) Пример переопределения переменных
```python
name = 'Ilya'
print(f'Hello world, my name {my_name}')
name = 'Oleg'
print(f'Hello world, my name {my_name}')
```

3) Посложнее
```python
number = 5 # int

digit = -4.54356876 # float
word = "Результат:" # string
boolean = True # bool

str_num = '5' # string

# print(word + str(digit))

print(word + str(number + int(str_num)))

del number

number = 7
print("Результат:", number)
```

## 4) Условные конструкции, циклы

### Теория:
#### Условные конструкции
https://github.com/titaev/brunoyam-python-lessons/blob/master/1.%20Introduction%20to%20Python.md  (8 пункт)
#### Циклы
https://github.com/titaev/brunoyam-python-lessons/blob/master/3.%20Cycles.md

### Закрепление:
#### Задача 1
Напишите программу, которая будет выводить нечетные числа из списка и остановится, если встретит число 139
```python
#  Функция, которая проверяет входной параметр на четность
def even(num):
    # Возвращаем True, если остаток от деления на 2 равен нулю
    return num % 2 == 0


if __name__ == '__main__':
    lst = [1, 34, 78, 345, 111, 8, 5, 34, 9, 3, 139, 56, 2, 67, 69, 90]

    # В цикле перебираем элементы вышесозданного списка
    for item in lst:
        # Если текущий элемент равен 139, то прерываем цикл
        if item == 139:
            break
        # Выводим элемент, если он не является четным
        if not even(item):
            print(item)
```

#### Задача 2
Дан список lst = [11, 5, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20]. 
Необходимо вывести элементы, которые одновременно 1) меньше 30 и 2) делятся на 3 без остатка. Все остальные элементы списка необходимо просуммировать и вывести конечный результат.
```python
# Задаем константы для значений, заданных в условии
MEDIAN = 30
DIV_NUM = 3

# Создаем список
lst = [11, 5, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20]

# Задаем начальное значение переменной для суммы элементов
sm = 0

# Поочередно перебираем элементы списка
for item in lst:
    # Проверяем, что
    # 1) Текущий элемент меньше 30
    # 2) Остаток от деления текущего элемента на 3 равен 0
    if (item < MEDIAN) and (item % DIV_NUM == 0):
        print(item)
    # Добавляем элемент к сумме, если условие не выполнено
    else:
        sm += item

# Выводим конечную сумму
print('Sum: ', sm)
```
## 5) Ввод - вывод, файловый ввод вывод

### Теория:

### Закрепление:

## 6) Встроенные структуры данных

### Теория:

### Закрепление:

## 7) Стандартные функции

### Теория:

### Закрепление:

## 8) Свои функции 

### Теория:

### Закрепление:

## 8) Система контроля версий. Git

### Теория:

### Закрепление:


# Самостоятельная работа:
## Задача 1 (функция, if, операторы)
Создать функцию calc(a, b, operation). Описание входных параметров:
1. Первое число
2. Второе число
3. Действие над ними:
   1) '+' Сложить
   2) '-' Вычесть
   3) '*' Умножить
   4) '/' Разделить
   5) В остальных случаях функция должна возвращать "Операция не поддерживается"
```python
def calc(a, b, operation):
    # Задаем дефолтное значение возвращаемого результата
    result = 'Операция не поддерживается'

    if operation == '+':
        result = a + b
    elif operation == '-':
        result = a - b
    elif operation == '*':
        result = a * b
    elif operation == '/':
        # Проверка деления на ноль
        if b is not 0:
            result = a / b
        else:
            result = 'Деление на 0!'

    # Возвращаем результат выполнения функции
    return result


if __name__ == '__main__':
    # Проверяем корректные значения
    print(calc(30, 15, '+'))
    print(calc(30, 15, '-'))
    print(calc(30, 15, '*'))
    print(calc(30, 15, '/'))
    # Проверяем проверку деления на ноль
    print(calc(30, 0, '/'))
    # Проверяем неподдерживаемую операцию
    print(calc(30, 15, '%'))
```

# Домашнее задание:


